Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་པ་དེ་དག་ནི་དེ་ལྟར་ཕན་པ་མང་པོ་བྱེད་པའོ། །རབ་འབྱོར་ངས་ཡང་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་།
en: It is in this manner, Subhūti, that bodhisattva great beings who set their minds on unsurpassed, complete enlightenment, and emphasize the real nature, achieve many acts of benefit. “

source: སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་བྱོལ་སོང་གི་སྐྱེ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བདག་ཡོངས་སུ་གཏོང་བ་བྱེད་ཅིང་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཡན་ལག་དང་། ཉིང་ལག་བཅད་ཅིང་གཏུབས་ཏེ། ཕྱོགས་བཅུར་རྣམ་པར་འཐོར་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སེམས་ཅན་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གི་ཤ་ཟོས་ནས།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, I see those bodhisattva great beings sacrificing themselves for the sake of beings in the animal realm; the limbs and appendages of these bodhisattva great beings being severed, cut, and scattered in the ten directions; and beings, including those of the animal realm, feeding upon the flesh of those bodhisattva great beings.

source: དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་བྱམས་པ་འཐོབ་པ་དང་། དེ་དག་བྱམས་པ་ཐོབ་པ་དེས། བྱོལ་སོང་གི་སྐྱེ་གནས་ནས་རྣམ་པར་ལྡང་ཞིང་། རྣམ་པར་ལངས་ནས། ལྷ་དང་མིའི་ནང་དུ་སྐྱེ་བ་དང་།
en: Consequently, they acquire loving kindness for those bodhisattva great beings, and having acquired loving kindness they become elevated from the animal realm, arise therefrom, and are born among the gods and human beings.

source: དེ་དག་ཏུ་སྐྱེས་ནས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཉེས་པར་བྱེད་པ་དང་།
en: Having been born in these realms, they also please the lord buddhas, {Ki.

source: དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཆོས་ཐོས་ཏེ།
en: VIII: 51} venerate the lord buddhas, and listen to the Dharma from the lord buddhas.

source: དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་པ་དང་། དེ་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་འམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་འམ། ཐེག་པ་ཆེན་པོ་འམ། ཐེག་པ་གསུམ་པོ་དེ་དག་གིས་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདའ་བའི་དབྱིངས་སུ་རིམ་གྱིས་མྱ་ངན་ལས་ཡོངས་སུ་འདའ་བ་མཐོང་སྟེ།
en: Emphasizing the real nature, by means of the three vehicles—the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the great vehicle—they gradually attain final nirvāṇa in the expanse of nirvāṇa where there is no residue of the psycho-physical aggregates.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་པ་དེ་དག་ནི་དེ་ལྟར་ཕན་པ་མང་པོ་བྱེད་པའོ།
en: It is in this manner, Subhūti, that bodhisattva great beings who set their minds on unsurpassed, complete enlightenment, and emphasize the real nature, achieve many acts of benefit. “

source: །རབ་འབྱོར་ངས་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཡི་དགས་ཀྱི་ཡུལ་པ་རྣམས་ཀྱི། ཡི་དགས་ཀྱི་ཡུལ་དེ་དག་ན་སྡུག་བསྔལ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་འཇིལ་ཞིང་སེར་སྣ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་པ་དང་།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, I see those bodhisattva great beings allaying all the many sufferings endured by the denizens of the realm of anguished spirits in the realms of the anguished spirits, and teaching the Dharma so that they might abandon miserliness.

source: དེ་དག་ན་སེམས་ཅན་ཡི་དགས་ཀྱི་ཡུལ་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་བྱམས་པའི་སེམས་བསྐྱེད་ཅིང་།
en: There those denizens of the realm of anguished spirits set their minds on loving kindness toward those bodhisattva great beings, and they are elevated from those realms of the anguished spirits.

source: ཡི་དགས་ཀྱི་སྐྱེ་གནས་དེ་དག་ནས་རྣམ་པར་ལྡང་བ་དང་། དེ་དག་ཡི་དགས་ཀྱི་སྐྱེ་གནས་དེ་དག་ནས་རྣམ་པར་ལངས་ནས། དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་ལྷའི་འཇིག་རྟེན་དང་། མིའི་འཇིག་རྟེན་དུ་སྐྱེས་ཏེ།
en: Arising from those realms of the anguished spirits, they are born through those very roots of virtuous action in the world of the gods and in the world of human beings.

source: ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་བ་དག་མཐོང་ངོ་། །རབ་འབྱོར་ངས་ཡང་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན།
en: Until they attain final nirvāṇa in the expanse of nirvāṇa where there is no residue of the psycho-physical aggregates, they will never be separated from the lord buddhas. “

source: ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཡི་དགས་ཀྱི་ཡུལ་པ་རྣམས་ཀྱི་ཡི་དགས་ཀྱི་ཡུལ་དེ་དག་ན། སྡུག་བསྔལ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་འཇིལ་ཞིང་སེར་སྣ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་པ་དང་།
en: Also, Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, I see those bodhisattva great beings allaying all the many sufferings endured by the denizens of the realm of anguished spirits in the realms of the anguished spirits, and teaching the Dharma so that they might abandon miserliness.

source: ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་བ་དག་མཐོང་ངོ་།
en: Until they attain final nirvāṇa in the expanse of nirvāṇa where there is no residue of the psycho-physical aggregates, they will never be separated from the lord buddhas. “

source: །རབ་འབྱོར་ང་ས་ཡང་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ལ་ཆོས་སྟོན་པ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ལ་ཆོས་སྟོན་པ་དང་།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, I see bodhisattva great beings teaching the Dharma to the gods of the Caturmahā­rāja­kāyika realm and teaching the Dharma to the gods of the Trayastriṃśa realm, the Yāma realm, the Tuṣita realm, the Nirmāṇarata realm, and the Para­nirmita­vaśa­vartin realm.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལས། ལྷའི་བུ་དེ་དག་གིས་ཆོས་དེ་ཐོས་ནས། ཐེག་པ་གསུམ་པོས་རིམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་མཐོང་སྟེ། རབ་འབྱོར་དེ་ལ་ལྷའི་བུ་གང་འདོད་པའི་ཡོན་ཏན་ལྔས་ཤས་ཆེར་མྱོས་པ་དེ་དག་ལ། གཞལ་མེད་ཁང་དེ་དག་འབར་བར་སྣང་བར་བྱས་ཤིང་། དེ་དག་སྐྱོ་བར་གྱུར་པར་ཤེས་ནས།
en: These gods listen to the Dharma from those bodhisattva great beings and gradually they have attained, are attaining, and will attain final nirvāṇa by means of the three vehicles. {

source: འདི་སྐད་དུ་གྲོགས་པོ་དག །འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་པ། འདུ་བྱེད་ཐམས་ཅད་ནི་སྡུག་བསྔལ་བ།
en: Ki.

source: འདུ་བྱེད་ཐམས་ཅད་ནི་བདག་མེད་པ། འདུ་བྱེད་ཐམས་ཅད་ནི་མི་བརྟན་པ། འདུ་བྱེད་ཐམས་ཅད་ནི་ཡིད་བརྟན་དུ་མི་རུང་བ། འདུ་བྱེད་ཐམས་ཅད་ནི་རྣམ་པར་འགྱུར་བའི་ཆོས་ཅན་ཡིན་ན། འདུ་བྱེད་རྣམས་ལ་ལྟ་སུ་ཞིག་ཡིད་ཕེབས་པར་གནས་ཞེས་ཆོས་སྟོན་ཏོ། །རབ་འབྱོར་ངས་ཡང་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ནས།
en: VIII: 52} “In this regard, Subhūti, they know that those gods who are mostly intoxicated by the five attributes of the senses become depressed when they perceive their celestial palaces ablaze, and teach them the Dharma, saying, ‘Friends, if all that is conditioned is impermanent, all that is conditioned is suffering, all that is conditioned is without self, all that is conditioned is unstable, all that is conditioned is unreliable, and all that is conditioned is changeable, who could possibly place their trust in all phenomena that are conditioned!’ “

source: ལྷོ་དང་ནུབ་དང་བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ལ་ཆོས་སྟོན་པ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, I see bodhisattva great beings teaching the Dharma to the gods of the Caturmahā­rāja­kāyika realm and teaching the Dharma to the gods of the Trayastriṃśa realm, the Yāma realm, the Tuṣita realm, the Nirmāṇarata realm, and the Para­nirmita­vaśa­vartin realm.

source: གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ལ་ཆོས་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལས་ལྷའི་བུ་དེ་དག་གིས་ཆོས་དེ་ཐོས་ནས། ཐེག་པ་གསུམ་པོས་རིམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་མཐོང་སྟེ།
en: These gods listen to the Dharma from those bodhisattva great beings and gradually they have attained, are attaining, and will attain final nirvāṇa by means of the three vehicles. “

source: རབ་འབྱོར་དེ་ལ་ལྷའི་བུ་གང་འདོད་པའི་ཡོན་ཏན་ལྔས་ཤས་ཆེར་མྱོས་པ་དེ་དག་ལ། གཞལ་མེད་ཁང་དེ་དག་འབར་བར་སྣང་བར་བྱས་ཤིང་དེ་དག་སྐྱོ་བར་གྱུར་པར་ཤེས་ནས། འདི་སྐད་དུ་གྲོགས་པོ་དག །འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་པ། འདུ་བྱེད་ཐམས་ཅད་ནི་སྡུག་བསྔལ་བ། འདུ་བྱེད་ཐམས་ཅད་ནི་བདག་མེད་པ། འདུ་བྱེད་ཐམས་ཅད་ནི་མི་བརྟན་པ། འདུ་བྱེད་ཐམས་ཅད་ནི་ཡིད་བརྟན་དུ་མི་རུང་བ། འདུ་བྱེད་ཐམས་ཅད་ནི་རྣམ་པར་འགྱུར་བའི་ཆོས་ཅན་ཡིན་ན། འདུ་བྱེད་རྣམས་ལ་ལྟ་སུ་ཞིག་ཡིད་ཕེབས་པར་གནས་ཞེས་ཆོས་སྟོན་ཏོ།
en: In this regard, Subhūti, they know that those gods who are mostly intoxicated by the five attributes of the senses become depressed when they perceive their celestial palaces ablaze, and teach them the Dharma, saying, ‘Friends, if all that is conditioned is impermanent, all that is conditioned is suffering, all that is conditioned is without self, all that is conditioned is unstable, all that is conditioned is unreliable, and all that is conditioned is changeable, who could possibly place their trust in all phenomena that are conditioned!’ “

source: །རབ་འབྱོར་ངས་ཡང་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སེམས་ཅན་གང་། ཚངས་པའི་ལྟ་བ་ལ་མངོན་པར་ཞེན་པ་དེ་དག་ལ། ཀྱེ་གྲོགས་པོ་དག་ཆོས་ཐམས་ཅད་སྟོང་པ་ལ་ཅི་ཞིག་ལྟ་བ་སྐྱེད།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, I see bodhisattva great beings teaching the Dharma to beings who are fixated on the view of Brahmā and separating them from those views with the words, ‘Friends, when all phenomena are empty, how could you possibly cultivate such views!

source: ཆོས་ཐམས་ཅད་གསོག་དང་། གསོབ་ཤ་སྟག་ལ་ཅི་ཞིག་ལྟ་བ་སྐྱེད། ཅེས་ལྟ་བའི་རྣམ་པ་དེ་དག་དང་བྲལ་བར་བྱེད་པ་མཐོང་སྟེ།
en: When all phenomena are void and absolutely hollow, how could you possibly cultivate such views!’

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ཤིང་། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །རབ་འབྱོར་དེ་ནི་ངོ་མཚར་ཆེ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྨད་དུ་བྱུང་བའི་ཆོས་སོ། །རབ་འབྱོར་ངས་ཡང་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ལྷོ་དང་ནུབ་དང་བྱང་དང་།
en: It is in this manner, Subhūti, that bodhisattva great beings teach the Dharma to beings, while maintaining great compassion.

source: བྱང་ཤར་དང་།
en: Subhūti, this is most wonderful!

source: ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་།
en: It is a marvelous attribute of bodhisattva great beings. “

source: ནུབ་བྱང་དང་འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས། སེམས་ཅན་གང་དག་ཚངས་པའི་ལྟ་བ་ལ་མངོན་པར་ཞེན་པ་དེ་དག་ལ། ཀྱེ་གྲོགས་པོ་དག་ཆོས་ཐམས་ཅད་སྟོང་པ་ལ་ཅི་ཞིག་ལྟ་བ་སྐྱེད།
en: Also, Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, I see bodhisattva great beings teaching the Dharma to beings who are fixated on the view of Brahmā and separating them from those views with the words, ‘Friends, when all phenomena are empty, how could you possibly cultivate such views!

source: ཆོས་ཐམས་ཅད་གསོག་དང་། གསོབ་ཤ་སྟག་ལ་ཅི་ཞིག་ལྟ་བ་སྐྱེད་ཅེས། ལྟ་བའི་རྣམ་པ་དེ་དག་དང་བྲལ་བར་བྱེད་པ་མཐོང་སྟེ།
en: When all phenomena are void and absolutely hollow, how could you possibly cultivate such views!’

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ཤིང་། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: It is in this manner, Subhūti, that bodhisattva great beings teach the Dharma to beings, while maintaining great compassion.

source: །རབ་འབྱོར་དེ་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: Subhūti, this is most wonderful!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྨད་དུ་བྱུང་བའི་ཆོས་སོ།
en: It is a marvelous attribute of bodhisattva great beings. “

source: །རབ་འབྱོར་ངས་ཡང་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་མི་རྣམས་བསྡུ་བའི་དངོས་པོ་བཞིས་སྡུད་པ་མཐོང་སྟེ།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, I see bodhisattva great beings teaching the Dharma to beings, attracting humankind by means of the four attractive qualities.

source: བཞི་གང་ཞེ་ན། སྦྱིན་པ་དང་ཚིག་སྙན་པ་དང་། དོན་སྤྱད་པ་དང་དོན་འཐུན་པའོ། །རབ་འབྱོར་ངས་ཡང་འདི་ནས། སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་རྣམ་པར་གཟིགས་ན།
en: If you ask what are these four, they comprise generosity, pleasant speech, purposeful activity, and harmony. “

source: ལྷོ་དང་ནུབ་དང་བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་མི་རྣམས་བསྡུ་བའི་དངོས་པོ་བཞིས་སྡུད་པ་མཐོང་སྟེ།
en: Subhūti, when I observe the world from here with the buddha eye, in all the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, I see bodhisattva great beings teaching the Dharma to beings, attracting humankind by means of the four attractive qualities.

source: བཞི་གང་ཞེ་ན་སྦྱིན་པ་དང་ཚིག་སྙན་པ་དང་དོན་སྤྱད་པ་དང་དོན་འཐུན་པའོ།
en: If you ask what are these four, they comprise generosity, pleasant speech, purposeful activity, and harmony. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པས་སེམས་ཅན་རྣམས་སྡུད་པ་ཡིན་ཞེ་ན་རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་གཉིས་ཀྱིས་སེམས་ཅན་རྣམས་སྡུད་དེ།
en: Subhūti, if you ask how bodhisattva great beings attract beings through generosity, in this regard, Subhūti, bodhisattva great beings attract beings through two kinds of gifts.

source: གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ་ཟང་ཟིང་གི་སྦྱིན་པ་དང་ཆོས་ཀྱི་སྦྱིན་པའོ།
en: If you ask what are these two, they comprise material gifts and gifts of the Dharma.

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཟང་ཟིང་གི་སྦྱིན་པས་སེམས་ཅན་རྣམས་སྡུད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གསེར་རམ་དངུལ་ལམ་ནོར་བུ་འམ་མུ་ཏིག་གམ་བཻ་ཌཱུརྱ་འམ་དུང་ངམ་མན་ཤེལ་ལམ་བྱི་རུའམ་ས་ལེ་སྦྲམ་འམ་ཟས་སམ་སྐོམ་འམ་གདུགས་སམ་གོས་སམ་སྤོས་སམ་ཕྲེང་བ་འམ་བྱུག་པ་འམ་མལ་ཆའམ་སྟན་ནམ་འཚོ་བ་འམ་བུད་མེད་དམ་སྐྱེས་པ་འམ་རྟ་འམ་གླང་པོ་ཆེ་འམ་བདག་པོ་ཡོངས་སུ་གཏོང་ན་འདི་སྐད་དུ་ཀྱེ་སེམས་ཅན་དག་ཚུར་ཤེག་བདག་ཉིད་ཀྱི་དང་འདྲ་བར་བསླང་མི་དགོས་པར་ཁྱེར་ཅིག །
en: Subhūti, if you ask how bodhisattva great beings attract beings through material gifts, in this case, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they give away gold, silver, gems, pearls, beryl, conch, quartz, coral, pure gold, food, drink, parasols, clothing, incense, garlands, unguents, bedding, mats, sustenance, women, men, horses, elephants, or their own [flesh], whereupon they say, ‘O beings, come here! You may carry off that which is ostensibly mine without having to ask!

source: ལོང་ལ་དེང་ཤིག་ཅེས་བརྗོད་དེ།
en: Take it and go!’ {Ki.

source: སྦྱིན་པ་དེས་སྦྱིན་པ་བྱིན་ནས། སངས་རྒྱས་ལ་སྐྱབས་སུ་གཏོང་ངོ་། །ཆོས་ལ་སྐྱབས་སུ་གཏོང་ངོ་། །དགེ་འདུན་ལ་སྐྱབས་སུ་གཏོང་ངོ་།
en: VIII: 53} Having bestowed their generosity through that gift, they cause them to take refuge in the buddhas, they cause them to take refuge in the Dharma and they cause them to take refuge in the saṅgha.

source: །ལ་ལ་ནི་བསླབ་པའི་གནས་ལྔ་འཛིན་དུ་འཛུད་དོ།
en: They encourage some to adopt the five precepts.

source: །ལ་ལ་ནི་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཉེ་བར་གནས་པ་ལ་ཉེ་བར་གནས་པར་བྱེད་དོ།
en: They cause some to engage in the eightfold observance.

source: །ལ་ལ་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ལ་འགོད་དོ།
en: They establish some on the paths of the ten virtuous actions.

source: །ལ་ལ་ནི་བསམ་གཏན་དང་པོ་ལ། ལ་ལ་ནི་བསམ་གཏན་གཉིས་པ་ལ། ལ་ལ་ནི་བསམ་གཏན་གསུམ་པ་ལ། ལ་ལ་ནི་བསམ་གཏན་བཞི་པ་ལ་འགོད་དོ།
en: They establish some in the first meditative concentration, some in the second meditative concentration, some in the third meditative concentration, and some in the fourth meditative concentration.

source: །ལ་ལ་ནི་བྱམས་པ་ལ། ལ་ལ་ནི་སྙིང་རྗེ་ལ། ལ་ལ་ནི་དགའ་བ་ལ། ལ་ལ་ནི་བཏང་སྙོམས་ལ་འགོད་དོ།
en: They establish some in loving kindness, some in compassion, some in empathetic joy, and some in equanimity.

source: །ལ་ལ་ནི་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ། ལ་ལ་ནི་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ། ལ་ལ་ནི་ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ། ལ་ལ་ནི་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་འགོད་དོ། །ལ་ལ་ནི་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ལ།
en: They establish some in the sphere of infinite space, some in the sphere of infinite consciousness, some in the sphere of nothing-at-all, and some in the sphere of neither perception nor nonperception.

source: ལ་ལ་ནི་ཆོས་རྗེས་སུ་དྲན་པ་ལ། ལ་ལ་ནི་དགེ་འདུན་རྗེས་སུ་དྲན་པ་ལ། ལ་ལ་ནི་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་ལ། ལ་ལ་ནི་གཏོང་བ་རྗེས་སུ་དྲན་པ་ལ། ལ་ལ་ནི་ལྷ་རྗེས་སུ་དྲན་པ་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: They encourage some toward the recollection of the Buddha, some toward the recollection of the Dharma, some toward the recollection of the Saṅgha, some toward the recollection of ethical discipline, some toward the recollection of giving away, and some toward the recollection of the god realms.

source: །ལ་ལ་ནི་ལུས་ལ་མི་གཙང་བ་ལ་སོགས་པའི་འདུ་ཤེས་སུ་སོ་སོར་བརྟག་པ་ལ། ལ་ལ་ནི་རྣམ་པར་དག་པ་ལ་ཡང་དག་པར་སྐུལ་ལོ། །ལ་ལ་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ། ལ་ལ་ནི་ཡང་དག་པར་སྤོང་བ་བཞི་ལ།
en: They encourage some to examine the perception of the physical body as impurity, and so forth, and some [to examine it] as purity.

source: ལ་ལ་ནི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ལ། ལ་ལ་ནི་དབང་པོ་ལྔ་ལ། ལ་ལ་ནི་སྟོབས་ལྔ་ལ། ལ་ལ་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ། ལ་ལ་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་ཡང་དག་པར་སྐུལ་ལོ། །ལ་ལ་ནི་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ། ལ་ལ་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་ལ།
en: They encourage some toward the four applications of mindfulness, some toward the four correct exertions, some toward the four supports for miraculous ability, some toward the five faculties, some toward the five powers, some toward the seven branches of enlightenment, and some toward the noble eightfold path.

source: ལ་ལ་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ། ལ་ལ་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ། ལ་ལ་ནི་མི་འཇིགས་པ་བཞི་ལ། ལ་ལ་ནི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ལ་ཡང་དག་པར་སྐུལ་ལོ། །ལ་ལ་ནི་བྱམས་པ་ཆེན་པོ་ལ། ལ་ལ་ནི་སྙིང་རྗེ་ཆེན་པོ་ལ།
en: They encourage some toward the meditative stabilities of emptiness, signlessness, and wishlessness, some toward the eight aspects of liberation, some toward the nine serial steps of meditative absorption, some toward the ten powers of the tathāgatas, some toward the four fearlessnesses, some toward the four kinds of exact knowledge, some toward great loving kindness, some toward great compassion, and some toward the eighteen distinct qualities of the buddhas.

source: ལ་ལ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡང་དག་པར་སྐུལ་ལོ། །ལ་ལ་ནི་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཡོངས་སུ་གྲུབ་པར་བྱ་བ་ལ་ཡང་དག་པར་སྐུལ་ལོ། །ལ་ལ་ནི་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: They encourage some toward to actualization of the thirty-two major marks of a great person, and some toward the eighty minor marks.

source: །ལ་ལ་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ། ལ་ལ་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ལ། ལ་ལ་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ། ལ་ལ་ནི་དགྲ་བཅོམ་པ་ཉིད་ལ། ལ་ལ་ནི་རང་བྱང་ཆུབ་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: They encourage some toward the fruit of entering the stream to nirvāṇa, some toward the fruit of being destined for only one more rebirth, some toward the fruit of no longer being subject to rebirth, some toward arhatship, and some toward individual enlightenment.

source: །ལ་ལ་ནི་བྱང་ཆུབ་ལ། ལ་ལ་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ། ལ་ལ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: They encourage some toward [unsurpassed] enlightenment, some toward knowledge of the path, and some toward all-aspect omniscience. {Ki.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ལ་ཟང་ཟིང་གི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་། ཐབས་མཁས་པས་བླ་ན་མེད་པའི་བདེ་བ་དང་ལྡན་པར་འགོད་དེ།
en: VIII: 54} Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, they dispense material gifts to beings and through skillful means establish them in unsurpassed security.

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བའི་ཆོས་སོ།
en: This, Subhūti, is a wonderful and marvelous attribute of bodhisattva great beings. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཀྱི་སྦྱིན་པས་སེམས་ཅན་རྣམས་སྡུད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་གཉིས་པོ་འདི་དག་ནི་ཆོས་ཀྱི་སྦྱིན་པ་སྟེ། འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའོ། །རབ་འབྱོར་འཇིག་རྟེན་པའི་ཆོས་ཀྱི་སྦྱིན་པ་གང་ཞེ་ན།
en: Subhūti, if you ask how, when bodhisattva great beings practice the perfection of wisdom, they attract beings with the gift of the Dharma, in this case, Subhūti, the gift of the Dharma is twofold—mundane and supramundane.

source: འཇིག་རྟེན་པའི་ཆོས་རྣམས་བརྗོད་པ་དང་། བཤད་པ་དང་། མ་ནོར་བར་བསྟན་པ་སྟེ། འདི་ལྟར་མི་གཙང་བའི་རྣམ་པ་དང་། བསམ་གཏན་བཞི་དང་།
en: Subhūti, if you ask what constitutes the mundane gift of the Dharma, it is the description, explanation, and unerring demonstration of mundane phenomena, including impure aspects, along with the four meditative concentrations, the four pure abidings, the four formless absorptions, and the five extrasensory powers.

source: ཚངས་པའི་རྣམ་པར་སྤྱོད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། གཞན་ཡང་འཇིག་རྟེན་པའི་ཆོས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དག་དང་ཐུན་མོང་དུ་གྱུར་པ་རྣམས་ཏེ།
en: In addition, it includes mundane attributes that are common to ordinary, simple people.

source: རབ་འབྱོར་དེ་ནི་འཇིག་རྟེན་པའི་ཆོས་ཀྱི་སྦྱིན་པའོ།
en: These, Subhūti, constitute the mundane gift of the Dharma. “
